app/views/ideas/index.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = 1 ORDER BY "users"."id" ASC LIMIT 1
---

          <%- if idea.user.present? %>