app/controllers/comments_controller.rb

  def index
    @comments = @idea.comments.all
---
SELECT "comments".* FROM "comments"

  def create
    @comment = @idea.comments.new(comment_params)
    @comment.save
---
INSERT INTO "comments" ("body", "created_at", "idea_id", "updated_at", "user_name") VALUES (?, ?, ?, ?, ?)  [["body", "Nice heart! <3"], ["created_at", Sat, 13 Jun 2015 13:11:25 UTC +00:00], ["idea_id", 2], ["updated_at", Sat, 13 Jun 2015 13:11:25 UTC +00:00], ["user_name", "Anonymous "]]

    def set_comment
      @comment = @idea.comments.find(params[:id])
---
SELECT "comments".* FROM "comments" WHERE "comments"."idea_id" = ? AND "comments"."id" = ? LIMIT 1  [["idea_id", 3], ["id", "6"]]

    def set_idea
      @idea = Idea.find(params[:idea_id])
---
SELECT "ideas".* FROM "ideas" WHERE "ideas"."id" = ? LIMIT 1  [["id", "3"]]