app/controllers/ideas_controller.rb

SELECT "ideas".* FROM "ideas" WHERE "ideas"."user_id" = ? AND "ideas"."id" = ? LIMIT 1  [["user_id", 1], ["id", "3"]]
---
  def edit
    @idea = current_user.ideas.find(params[:id])

INSERT INTO "ideas" ("created_at", "description", "name", "picture", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @idea = current_user.ideas.new(idea_params)

    respond_to do |format|
      if @idea.save

SELECT "ideas".* FROM "ideas" WHERE "ideas"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "ideas" SET "picture" = ?, "updated_at" = ? WHERE "ideas"."id" = 1  [["picture", "pi5e8dMLT.png"], ["updated_at", Sat, 13 Jun 2015 09:12:43 UTC +00:00]]
---
  def update
    @idea = current_user.ideas.find(params[:id])
    respond_to do |format|
      if @idea.update(idea_params)

SELECT "ideas".* FROM "ideas" WHERE "ideas"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "ideas" WHERE "ideas"."id" = ?  [["id", 1]]
---
  def destroy
    @idea = current_user.ideas.find(params[:id])
    @idea.destroy

SELECT "ideas".* FROM "ideas" WHERE "ideas"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "comments".* FROM "comments" WHERE "comments"."idea_id" = ?  [["idea_id", 2]]
---
    def set_idea
      @idea = Idea.find(params[:id])
      @comments = @idea.comments.all